package com.inducesmile.androidpayexample;


import android.content.Context;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.TextView;

/**
 * Created by SrikanthBk(ThinkNext)peace on 08-05-2018.
 */

public class LyricSongAdapter extends BaseAdapter {
    private Context mContext;
    public LyricSongAdapter(Context c){
        mContext=c;
    }
    @Override
    public int getCount() {
        return 0;
    }

    @Override
    public Object getItem(int i) {
        return null;
    }

    @Override
    public long getItemId(int i) {
        return 0;
    }

    @Override
    public View getView(int position, View convertView, ViewGroup parent) {
        TextView textView;
        // if it's not recycled, initialize some attributes
        if (convertView == null) {
            textView = new TextView(mContext);
            // Center crop image
            // textView.setScaleType(TextView.ScaleType.CENTER_CROP);
        } else {
            textView = (TextView) convertView;
        }
        // Set images into ImageView
        //imageView.setImageResource(mThumbIds[position]);
        //setScaleAnimation(imageView);
        textView.setText(lyricsTextViews[position]);
        return textView;
    }
    public String[] lyricsTextViews={"ಪಂಕ್ ಆಗಿ ಟ್ವಿಂಕಲಾಗಿ \n" +
            "ಏಲ್ಲ ಶೈನ್ ಆಗಿದೆ\n" +
            "\n" +
            "ಸ್ವೀಟ್ ಆಗಿ ಸಿಂಪಲ್ ಆಗಿ\n" +
            "ಮತ್ತೆ ಸಿಂಕ್ ಆಗಿದೆ  \n" +
            "\n" +
            "ನನ್ ಕಾಲ್ ಮಾಡೊ \n" +
            "ಕಾಲಿಂಗ್ ಬೆಲ್ಲು \n" +
            "ನೀನೆ ಸೇವಂತಿ \n" +
            "ಈ ಬ್ಯೂಟಿಫುಲ್ ಆಸೆಗೆಲ್ಲ \n" +
            "ಎನಂತ ಹೆಸರಿಡ್ತಿ \n" +
            "\n" +
            "ನಿನ್ ಅಪ್ಪಿ ತಬ್ಬಿಕೊಂಡು \n" +
            "ನಿಂಗ್ ಎತ್ತಬೇಕು ಆರತಿ \n" +
            "ನನ್ ಲೈಫಿನ್ ಲೈಟ್ ಆನ್ ಮಾಡೊ \n" +
            "ಹೊಸ ಪದ್ಮಾವತಿ \n" +
            "\n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ \n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ \n" +
            "\n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಗುಂಗಲ್ಲಿ \n" +
            "ಮೂರ್ ಲೋಕಾನೆ ತೋರ್ಸ್ಬುಟ್ಟೆ  \n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಲವಲ್ಲಿ \n" +
            "ನಾನ್ ಕಲರ್ಫುಲ್ ಆಗ್ಬುಟ್ಟೆ \n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಗುಂಗಲ್ಲಿ \n" +
            "ಮೂರ್ ಲೋಕಾನೆ ತೋರ್ಸ್ಬುಟ್ಟೆ  ಹಾ... \n" +
            "\n" +
            "ಕ್ಲಾಸಲ್ಲಿ ಕ್ಲಾಸಿಕ್ ನಾನು \n" +
            "ತುಂಬಾನೆ ಸ್ಟಾಂಡರ್ಡು \n" +
            "ಪ್ರೈಸ್ ಮಾಡಿ \n" +
            "ಪ್ಲೀಸ್ ಮಾಡುದ್ರು \n" +
            "ಕಷ್ಟಾನೆ ಬಿಟ್ಬಿಡು \n" +
            "\n" +
            "ರೋಸನ್ನ ಸೇಫ್ ಮಾಡೋಕೆ \n" +
            "ಮುಳ್ಳಿರ್ಬೇಕಂತೆ \n" +
            "ನಿನ್ ಹಿಂದೆ ಮುಂದೆ \n" +
            "ಸುತ್ತಾಡ್ಕೊಂಡು \n" +
            "ಸಖತ್ತಾಗಿ ನೋಡ್ಕೋತೀನಿ \n" +
            "ಪದ್ಮಾವತೀ... \n" +
            "\n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್\n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್\n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಗುಂಗಲ್ಲಿ \n" +
            "ಮೂರ್ ಲೋಕಾನೆ ತೋರ್ಸ್ಬುಟ್ಟೆ  \n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಲವಲ್ಲಿ\n" +
            "ನಾನ್ ಕಲರ್ಫುಲ್ ಆಗ್ಬುಟ್ಟೆ\n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಗುಂಗಲ್ಲಿ\n" +
            "ಮೂರ್ ಲೋಕಾನೆ ತೋರ್ಸ್ಬುಟ್ಟೆ  ಹಾ... \n" +
            "\n" +
            "ಇಂತ ಒಳ್ಳೆ ನಂಟು \n" +
            "ಸಿಗೊದಂತು ಡೌಟು \n" +
            "ತುಪ್ಪದಲ್ಲಿ ತಿಂದ ಹಾಗೆ ಒಬ್ಬಟ್ಟು \n" +
            "ಹಾ ಹಾ ಪದ್ದು \n" +
            "\n" +
            "ಅಸೆ ನೂರ ಏಂಟು \n" +
            "ಹಾಕ್ಲ ಮೂರು ಗಂಟು \n" +
            "ಫ್ಯಾಮಿಲಿ ಪ್ಲಾನಿಂಗ್ ಮರ್ತ್ಬಿಟ್ಟು \n" +
            "\n" +
            "ಸ್ಮೈಲಲ್ಲಿ ಊರಲೆಲ್ಲ \n" +
            "ನಾನೇನೆ ಫೇಮಸ್ಸು \n" +
            "ನನ್ ಹಿಂದೆ ಒಮ್ಮೆ  ನೋಡು \n" +
            "ಹುಡುಗರ ಸರ್ಕಸ್ಸು\n" +
            "\n" +
            "ನಂಗೂನು ಎಲ್ಲ  ಗಲ್ಲಿಲ್ \n" +
            "ಫ್ಯಾನ್ಸ್ ಅವ್ರೆ ಅಮ್ಮಣ್ಣಿ \n" +
            "ನಾ ಕೈ ಎತ್ತಿ ಮುಗ್ದ ಅಂದ್ರೆ\n" +
            "ದುನಿಯ ಪೂರ ನಂದೇನೆ \n" +
            "ಪದ್ಮಾವತಿ \n" +
            "\n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್\n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್\n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಗುಂಗಲ್ಲಿ \n" +
            "ಮೂರ್ ಲೋಕಾನೆ ತೋರ್ಸ್ಬುಟ್ಟೆ  \n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಲವಲ್ಲಿ \n" +
            "ನಾನ್ ಕಲರ್ಫುಲ್ ಆಗ್ಬುಟ್ಟೆ \n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಗುಂಗಲ್ಲಿ \n" +
            "ಮೂರ್ ಲೋಕಾನೆ ತೋರ್ಸ್ಬುಟ್ಟೆ  ಹಾ... \n" +
            "\n" +
            "ಪಂಕ್ ಆಗಿ ಟ್ವಿಂಕಲಾಗಿ \n" +
            "ಏಲ್ಲ ಶೈನ್ ಆಗಿದೆ \n" +
            "\n" +
            "ಸ್ವೀಟ್ ಆಗಿ ಸಿಂಪಲ್ ಆಗಿ \n" +
            "ಮತ್ತೆ ಶೈನ್ ಆಗಿದೆ  \n" +
            "\n" +
            "ನನ್ ಕಾಲ್ ಮಾಡೊ \n" +
            "ಕಾಲಿಂಗ್ ಬೆಲ್ಲು \n" +
            "ನೀನೆ ಸೇವಂತಿ \n" +
            "ಈ ಬ್ಯೂಟಿಫುಲ್ ಆಸೆಗೆಲ್ಲ \n" +
            "ಎನಂತ ಹೆಸರಿಡ್ತಿ \n" +
            "\n" +
            "ನಿನ್ ಅಪ್ಪಿ ತಬ್ಬಿಕೊಂಡು \n" +
            "ನಿಂಗ್ ಎತ್ತಬೇಕು ಆರತಿ \n" +
            "ನನ್ ಲೈಫಿನ್ ಲೈಟ್ ಆನ್ ಮಾಡೊ \n" +
            "ಹೊಸ ಪದ್ಮಾವತಿ \n" +
            "\n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ \n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ \n" +
            "\n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಗುಂಗಲ್ಲಿ \n" +
            "ಮೂರ್ ಲೋಕಾನೆ ತೋರ್ಸ್ಬುಟ್ಟೆ  \n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಲವಲ್ಲಿ \n" +
            "ನಾನ್ ಕಲರ್ಫುಲ್ ಆಗ್ಬುಟ್ಟೆ \n" +
            "ನಿನ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಕಲರ್ ಗುಂಗಲ್ಲಿ \n" +
            "ಮೂರ್ ಲೋಕಾನೆ ತೋರ್ಸ್ಬುಟ್ಟೆ  ಹಾ... "
    ,"ನೀನೆ ನನಗೆಲ್ಲ \n" +
            "ಅನ್ನೋ ಹಾಗಿದೆ ಅಲ್ಲ  \n" +
            "ನಿನ್ನಾಸೆರೆ ನಾನು \n" +
            "ಮರು ಮಾತೆ ಇಲ್ಲ \n" +
            "\n" +
            "ಕೈ ಹಿಡಿದು \n" +
            "ಒಂಟಿ ಬೀದೀಲಿ \n" +
            "ನಡೆವಾಗ ದಾರಿ\n" +
            "ಕೊನೆಯಲ್ಲಿ \n" +
            "\n" +
            "ಏನನೋ ಹೇಳುವ \n" +
            "ಆಸೆಯಿನ್ನು\n" +
            "ಮಾತಿಗು ಮೀರಿದ \n" +
            "ಚಂದ ನೀನು \n" +
            "\n" +
            "ಅರೆರೆ ಅರೆ ಏನಿದು \n" +
            "ನನಗೆ ಎಲ್ಲ ಹೊಸದಿದು \n" +
            "ನನ್ನ ನಾಳೆಗಳು \n" +
            "ನಿನಗೆ ಬಿಟ್ಟಿದ್ದು \n" +
            "\n" +
            "ಅರೆರೆ ಅರೆ ಏನಿದು \n" +
            "ನನಗೆ ಎಲ್ಲ ಹೊಸದಿದು \n" +
            "ನನ್ನ ನಾಳೆಗಳು \n" +
            "ನಿನಗೆ ಬಿಟ್ಟಿದ್ದು \n" +
            "\n" +
            "ಉಲ್ಲಾಸದ ಉತ್ತುಂಗವ \n" +
            "ನಾನೇರಿ ಕುಳಿತಾಯ್ತು \n" +
            "ಎಲ್ಲಾ ಖುಷಿ ನಂದಾಗಿದೆ \n" +
            "ಒಲವೇನೊ \n" +
            "\n" +
            "ಮಾತಲ್ಲಿಯೆ ಮುದ್ದಡಿಸೊ \n" +
            "ಕಲೆಯನ್ನು ಕಲಿಸಾಯ್ತು \n" +
            "ಇನ್ನೇನಿದೆ ಹಿಂಬಾಲಿಸು \n" +
            "ನನ್ನಿಂದೆ \n" +
            "\n" +
            "ಬರಿ ಸಾಲಿನಲ್ಲಿ ಸೆರೆ ಆಗದು \n" +
            "ಗುನುಗುನುಗುತ ತಿಳಿಸೇಳೊ \n" +
            "ಗುಟ್ಟಿದು \n" +
            "\n" +
            "ಬರಿ ಹಂತದಲ್ಲು ಆರಂಭವೆ \n" +
            "ಮೊದಲಿಂದ ಹೇಗೆ ಪ್ರೀತಿನ ಮಾಡುವೆ \n" +
            "\n" +
            "ಅರೆರೆ ಅರೆ ಏನಿದು \n" +
            "ನನಗೆ ಎಲ್ಲ ಹೊಸದಿದು \n" +
            "ನನ್ನ ನಾಳೆಗಳು \n" +
            "ನಿನಗೆ ಬಿಟ್ಟಿದ್ದು \n" +
            "\n" +
            "ಅರೆರೆ ಅರೆ ಏನಿದು \n" +
            "ನನಗೆ ಎಲ್ಲ ಹೊಸದಿದು \n" +
            "ನನ್ನ ನಾಳೆಗಳು \n" +
            "ನಿನಗೆ ಬಿಟ್ಟಿದ್ದು \n" +
            "\n" +
            "ನೀನೆ ನನಗೆಲ್ಲ \n" +
            "ಅನ್ನೋ ಹಾಗಿದೆ ಅಲ್ಲ  \n" +
            "ನಿನ್ನಾಸೆರೆ ನಾನು \n" +
            "ಮರು ಮಾತೆ ಇಲ್ಲ \n" +
            "\n" +
            "ಕೈ ಹಿಡಿದು \n" +
            "ಒಂಟಿ ಬೀದೀಲಿ \n" +
            "ನಡೆವಾಗ ದಾರಿ \n" +
            "ಕೊನೆಯಲ್ಲಿ \n" +
            "\n" +
            "ಏನನೋ ಹೇಳುವ \n" +
            "ಆಸೆಯಿನ್ನು \n" +
            "ಮಾತಿಗು ಮೀರಿದ \n" +
            "ಚಂದ ನೀನು \n" +
            "\n" +
            "ಅರೆರೆ ಅರೆ ಏನಿದು \n" +
            "ನನಗೆ ಎಲ್ಲ ಹೊಸದಿದು \n" +
            "ನನ್ನ ನಾಳೆಗಳು \n" +
            "ನಿನಗೆ ಬಿಟ್ಟಿದ್ದು \n" +
            "\n" +
            "ಅರೆರೆ ಅರೆ ಏನಿದು \n" +
            "ನನಗೆ ಎಲ್ಲ ಹೊಸದಿದು \n" +
            "ನನ್ನ ನಾಳೆಗಳು \n" +
            "ನಿನಗೆ ಬಿಟ್ಟಿದ್ದು "};
}
